app/Controllers/Admin/Company/Branch.php

    public function getBranches()
    {
        $data = $this->branch->where(['branch_status' => 'Active'])->findAll();;
---
SELECT *
FROM `branches`
WHERE `branch_status` = 'Active'
AND `branches`.`deleted_at` IS NULL