app/Controllers/Admin/Accounts/Particular.php

    public function accountType_particulars($account_type = null)
    {
        $data = $this->particular
            ->select('particulars.*, subcategories.id as s_id, subcategories.subcategory_name, subcategories.subcategory_status, subcategories.subcategory_slug, subcategories.created_at as screated, subcategories.updated_at as supdated, categories.id as c_id, categories.category_name,categories.category_slug, categories.part, statements.name as statement, account_types.name as account_type')
            ->join('subcategories', 'subcategories.id = particulars.subcategory_id', 'left')
            ->join('categories', 'categories.id = particulars.category_id', 'left')
            ->join('statements', 'statements.id = categories.statement_id', 'left')
            ->join('account_types', 'account_types.id = particulars.account_typeId', 'left')
            ->join('cash_flow_types', 'cash_flow_types.id = particulars.cash_flow_typeId', 'left')
            ->where(['particulars.account_typeId' => $account_type, 'particulars.particular_status' => 'Active'])
            ->findAll();
---
SELECT `particulars`.*, `subcategories`.`id` as `s_id`, `subcategories`.`subcategory_name`, `subcategories`.`subcategory_status`, `subcategories`.`subcategory_slug`, `subcategories`.`created_at` as `screated`, `subcategories`.`updated_at` as `supdated`, `categories`.`id` as `c_id`, `categories`.`category_name`, `categories`.`category_slug`, `categories`.`part`, `statements`.`name` as `statement`, `account_types`.`name` as `account_type`
FROM `particulars`
LEFT JOIN `subcategories` ON `subcategories`.`id` = `particulars`.`subcategory_id`
LEFT JOIN `categories` ON `categories`.`id` = `particulars`.`category_id`
LEFT JOIN `statements` ON `statements`.`id` = `categories`.`statement_id`
LEFT JOIN `account_types` ON `account_types`.`id` = `particulars`.`account_typeId`
LEFT JOIN `cash_flow_types` ON `cash_flow_types`.`id` = `particulars`.`cash_flow_typeId`
WHERE `particulars`.`account_typeId` = '18'
AND `particulars`.`particular_status` = 'Active'
AND `particulars`.`deleted_at` IS NULL