app/Controllers/Admin/Loans/Product.php

SELECT `loanproducts`.*, `principalParticular`.`particular_name` as `principal_particular`, `interestParticular`.`particular_name` as `interest_particular`
FROM `loanproducts`
LEFT JOIN `particulars` as `principalParticular` ON `principalParticular`.`id` = `loanproducts`.`principal_particular_id`
LEFT JOIN `particulars` as `interestParticular` ON `interestParticular`.`id` = `loanproducts`.`interest_particular_id`
WHERE `loanproducts`.`deleted_at` IS NULL
AND `loanproducts`.`id` = '1'
---
    public function show($id = null)
    {
        $data = $this->loanProduct->select('loanproducts.*, principalParticular.particular_name as principal_particular, interestParticular.particular_name as interest_particular')
        ->join('particulars as principalParticular', 'principalParticular.id = loanproducts.principal_particular_id', 'left')->join('particulars as interestParticular', 'interestParticular.id = loanproducts.interest_particular_id', 'left')->find($id);

SELECT *
FROM `loanproducts`
WHERE `status` = 'Active'
AND `loanproducts`.`deleted_at` IS NULL
---
    public function getProducts()
    {
        $data = $this->loanProduct->where(['status' => 'Active'])->findAll();