app/Controllers/Microfinance/BaseController.php

SELECT `settings`.*, `currencies`.`currency`, `currencies`.`symbol`
FROM `settings`
LEFT JOIN `currencies` ON `currencies`.`id` = `settings`.`currency_id`
WHERE `settings`.`deleted_at` IS NULL
AND `settings`.`id` = 1
---
        # load session
        $this->session = session();
        # load settings
        $this->settingsRow = $this->settings
            ->select('settings.*, currencies.currency,  currencies.symbol')
            ->join('currencies', 'currencies.id = settings.currency_id', 'left')
            ->find($this->settingId);

SELECT *
FROM `menus`
WHERE `status` = 'Active'
AND `menus`.`deleted_at` IS NULL
ORDER BY `order`
---
    public function load_menu()
    {
        $menus = $this->menuModel->where(['status' => 'Active'])->orderBy('order')->findAll();

SELECT `particulars`.*, `categories`.`id` as `c_id`, `categories`.`category_name`, `categories`.`category_slug`, `categories`.`part`, `subcategories`.`id` as `s_id`, `subcategories`.`subcategory_name`, `subcategories`.`subcategory_status`, `subcategories`.`subcategory_slug`, `subcategories`.`created_at` as `screated`, `subcategories`.`updated_at` as `supdated`, `statements`.`name` as `statement`, `account_types`.`id` as `type_id`, `account_types`.`name` as `account_type`, `cash_flow_types`.`id` as `cash_flow_id`, `cash_flow_types`.`name` as `cash_flow_type`
FROM `particulars`
LEFT JOIN `categories` ON `categories`.`id` = `particulars`.`category_id`
LEFT JOIN `subcategories` ON `subcategories`.`id` = `particulars`.`subcategory_id`
LEFT JOIN `statements` ON `statements`.`id` = `categories`.`statement_id`
LEFT JOIN `account_types` ON `account_types`.`id` = `particulars`.`account_typeId`
LEFT JOIN `cash_flow_types` ON `cash_flow_types`.`id` = `particulars`.`cash_flow_typeId`
WHERE `particulars`.`deleted_at` IS NULL
AND `particulars`.`id` = '1'
---
    protected function particularDataRow($id)
    {
        $row = $this->particular
            ->select('particulars.*, categories.id as c_id, categories.category_name,categories.category_slug, categories.part, subcategories.id as s_id, subcategories.subcategory_name, subcategories.subcategory_status, subcategories.subcategory_slug, subcategories.created_at as screated, subcategories.updated_at as supdated, statements.name as statement, account_types.id as type_id ,account_types.name as account_type, cash_flow_types.id as cash_flow_id, cash_flow_types.name as cash_flow_type')
            ->join('categories', 'categories.id = particulars.category_id', 'left')
            ->join('subcategories', 'subcategories.id = particulars.subcategory_id', 'left')
            ->join('statements', 'statements.id = categories.statement_id', 'left')
            ->join('account_types', 'account_types.id = particulars.account_typeId', 'left')
            ->join('cash_flow_types', 'cash_flow_types.id = particulars.cash_flow_typeId', 'left')
            ->find($id);

SELECT `clients`.`id`, `clients`.`name`, `clients`.`title`, `clients`.`branch_id`, `clients`.`staff_id`, `clients`.`account_no`, `clients`.`account_type`, `clients`.`savings_products`, `clients`.`account_balance`, `clients`.`email`, `clients`.`mobile`, `clients`.`alternate_no`, `clients`.`gender`, `clients`.`dob`, `clients`.`marital_status`, `clients`.`religion`, `clients`.`nationality`, `clients`.`occupation`, `clients`.`job_location`, `clients`.`residence`, `clients`.`closest_landmark`, `clients`.`id_type`, `clients`.`id_number`, `clients`.`id_expiry_date`, `clients`.`next_of_kin_name`, `clients`.`next_of_kin_relationship`, `clients`.`next_of_kin_contact`, `clients`.`next_of_kin_alternate_contact`, `clients`.`nok_email`, `clients`.`nok_address`, `clients`.`photo`, `clients`.`id_photo_front`, `clients`.`id_photo_back`, `clients`.`signature`, `clients`.`access_status`, `clients`.`2fa`, `clients`.`account`, `clients`.`reg_date`, `clients`.`created_at`, `clients`.`updated_at`, `branches`.`branch_name`, `staffs`.`staff_name`, `staffs`.`staffID`
FROM `clients`
LEFT JOIN `branches` ON `branches`.`id` = `clients`.`branch_id`
LEFT JOIN `staffs` ON `staffs`.`id` = `clients`.`staff_id`
WHERE `clients`.`deleted_at` IS NULL
AND `clients`.`id` = '117'
---
    protected function clientDataRow($id)
    {
        $data = $this->client
            ->select('clients.id, clients.name, clients.title, clients.branch_id, clients.staff_id, clients.account_no, clients.account_type, clients.savings_products, clients.account_balance, clients.email, clients.mobile, clients.alternate_no, clients.gender, clients.dob, clients.marital_status, clients.religion, clients.nationality, clients.occupation, clients.job_location, clients.residence, clients.closest_landmark, clients.id_type, clients.id_number, clients.id_expiry_date, clients.next_of_kin_name, clients.next_of_kin_relationship, clients.next_of_kin_contact, clients.next_of_kin_alternate_contact, clients.nok_email, clients.nok_address, clients.photo, clients.id_photo_front, clients.id_photo_back, clients.signature, clients.access_status, clients.2fa, clients.account, clients.reg_date, clients.created_at, clients.updated_at, branches.branch_name, staffs.staff_name, staffs.staffID')
            ->join('branches', 'branches.id = clients.branch_id', 'left')
            ->join('staffs', 'staffs.id = clients.staff_id', 'left')
            ->find($id);

SELECT *
FROM `applicant_products`
WHERE `application_id` = '3'
AND `applicant_products`.`deleted_at` IS NULL
 LIMIT 1
---
    protected function loanApplicationRow($id)
    {
        $data = $this->loanApplication
            ->select('loanapplications.*, clients.id as c_id, clients.name, clients.title, clients.account_no, clients.account_balance, clients.savings_products, clients.email, clients.mobile, clients.residence, clients.closest_landmark, clients.photo, clients.id_number, clients.next_of_kin_name, clients.next_of_kin_contact, clients.gender, clients.religion, clients.marital_status, clients.nationality, clients.alternate_no, clients.dob, clients.occupation, clients.job_location, clients.id_type, clients.id_expiry_date, clients.next_of_kin_relationship, clients.next_of_kin_alternate_contact, clients.nok_email, clients.nok_address, clients.account_type as acc_type, clients.signature as sign, clients.id_photo_front, clients.id_photo_back, loanproducts.product_name, loanproducts.principal_particular_id, loanproducts.interest_particular_id, branches.branch_name, staffs.staff_name, staffs.staffID, staffs.signature, applicant_products.interest_rate, applicant_products.repayment_frequency, applicant_products.repayment_period, applicant_products.interest_period, applicant_products.interest_type, applicant_products.id as applicant_product_id, applicant_products.loan_period, applicant_products.loan_frequency')
            ->join('clients', 'clients.id = loanapplications.client_id', 'left')
            ->join('staffs', 'staffs.id = loanapplications.staff_id', 'left')
            ->join('loanproducts', 'loanproducts.id = loanapplications.product_id', 'left')
            ->join('applicant_products', 'applicant_products.application_id = loanapplications.id', 'left')
            ->join('branches', 'branches.id = clients.branch_id', 'left')
            ->find($id);
        if ($data) {
            $data['ecryptedId'] = bin2hex($this->encrypter->encrypt($data['id']));
            $data['charges'] = unserialize($data['overall_charges']);
            $applicantProduct = $this->applicantProduct->where(['application_id' => $id])->first();

SELECT `full_name` as `relation_name`, `contact` as `relation_contact`, `alternate_contact` as `relation_alternate_contact`, `email` as `relation_email`, `address` as `relation_address`, `relationship` as `relation_relationship`
FROM `relationships`
WHERE `type` = 'next_of_kin'
AND `client_id` = '117'
AND `relationships`.`deleted_at` IS NULL
---
    protected function getRelationship($type, $id){
        if ($type == 'nok') {
            $where = ['type' => 'next_of_kin', 'client_id' => $id];
        } else {
            $where = ['type' => 'guarantor', 'application_id' => $id];
        }
        $data = $this->relationships->select('id as relation_id, full_name as relation_name, contact as relation_contact, alternate_contact as relation_alternate_contact, email as relation_email, address as relation_address, relationship as relation_relationship')->where($where)->findAll();

SELECT `products`.*, `savingsParticular`.`particular_name`
FROM `products`
LEFT JOIN `particulars` as `savingsParticular` ON `savingsParticular`.`id` = `products`.`savings_particular_id`
WHERE `products`.`deleted_at` IS NULL
AND `products`.`id` = '1'
---
    protected function get_productsDetails(array $products, $type = 'loans')
    {
        $productData = []; // Initialize an empty array to store product data

        foreach ($products as $item) {
            if ($type == 'loans') {
                $productRow = $this->loanProduct->find($item->product_id);
            } else {
                $productRow = $this->product->select('products.*, savingsParticular.particular_name')->join('particulars as savingsParticular', 'savingsParticular.id = products.savings_particular_id', 'left')->find($item->product_id);

SELECT SUM(CASE WHEN LOWER(entries.status) = "debit" THEN entries.amount ELSE 0 END) as sharesDebit, SUM(CASE WHEN LOWER(entries.status) = "credit" THEN entries.amount ELSE 0 END) as sharesCredit
FROM `entries`
WHERE `entries`.`account_typeId` = 8
AND `entries`.`client_id` = '117'
---
    protected function client_sharesBalance($client_id = null)
    {
        $clientShares = $this->entry->select('
            SUM(CASE WHEN LOWER(entries.status) = "debit" THEN entries.amount ELSE 0 END) as sharesDebit,
            SUM(CASE WHEN LOWER(entries.status) = "credit" THEN entries.amount ELSE 0 END) as sharesCredit')
            ->where(['entries.account_typeId' => 8, 'entries.client_id' => $client_id])
            ->get()->getRow();

SELECT COUNT(id) as totalDisbursements, SUM(total_balance) totalLoanBalance
FROM `disbursements`
WHERE `class` != 'Cleared'
AND `client_id` = '117'
---
    public function client_loans($clientId = null)
    {
        $allDisbursements = $this->disbursement->select('COUNT(id) as totalDisbursements, SUM(total_balance) totalLoanBalance')->where(['class !=' => 'Cleared', 'client_id' => $clientId])->get()->getRow();