app/Controllers/Admin/Clients/Client.php

SELECT *
FROM `clients`
WHERE `clients`.`deleted_at` IS NULL
AND `clients`.`id` = '117'
---
    public function show($id = null)
    {
        $data = $this->client->find($id);

SELECT *
FROM `clients`
WHERE `access_status` = 'Active'
AND `clients`.`deleted_at` IS NULL
---
    public function getClients()
    {
        $data = $this->client->where(['access_status' => 'Active'])->findAll();