app/Controllers/MasterController.php

SELECT `users`.*, `branches`.`branch_name`, `positions`.`position`, `positions`.`id` as `position_id`, `departments`.`department_name`
FROM `users`
LEFT JOIN `branches` ON `branches`.`id` = `users`.`branch_id`
LEFT JOIN `staffs` ON `staffs`.`id` = `users`.`staff_id`
LEFT JOIN `positions` ON `positions`.`id` = `staffs`.`position_id`
LEFT JOIN `departments` ON `departments`.`id` = `positions`.`department_id`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '1'
---
    public function __construct()
    {
        parent::__construct();
        # Check the Settings Information
        if ($this->settingsRow) {
            # load user data if session is set
            $user_id = session()->get('id');

            if (!isset($user_id)) {
                // session()->setFlashdata('failed', "Your Session Has Expired. Kindly Login Again!");
                return redirect()->to('/admin/login');
            } else {
                $this->userRow = $this->user->select('users.*, branches.branch_name,
                positions.position, positions.id as position_id, departments.department_name')
                    ->join('branches', 'branches.id = users.branch_id', 'left')
                    ->join('staffs', 'staffs.id = users.staff_id', 'left')
                    ->join('positions', 'positions.id = staffs.position_id', 'left')
                    ->join('departments', 'departments.id = positions.department_id', 'left')
                    ->find(session()->get('id'));

SELECT DISTINCT `id`, `id`
FROM `clients`
WHERE `access_status` = 'Active'
AND `clients`.`deleted_at` IS NULL
SELECT DISTINCT `client_id`, `client_id`
FROM `entries`
WHERE `account_typeId` = 12
AND `entries`.`deleted_at` IS NULL
SELECT `particulars`.`id`, `particulars`.`particular_code`, `particulars`.`particular_name`, `particulars`.`category_id`, `categories`.`part`
FROM `particulars`
LEFT JOIN `categories` ON `categories`.`id` = `particulars`.`category_id`
WHERE `account_typeId` = 12
AND `particulars`.`deleted_at` IS NULL
---
    public function auto_update_accountBalance()
    {
        $savings_account_typeId = 12; // account type id for savings

        // Get distinct clients' ids for all active clients
        $allClientIds = $this->client->distinct()->select('id')->where(['access_status' => 'Active'])->findColumn('id');
        if (!$allClientIds) {
            return $this->respond([
                'status' => 404,
                'error' => 'Not Found',
                'message' => "No Client Ids Found",
            ]);
        }

        // Get distinct client IDs with savings entries
        $clientIds_entries = $this->entry->distinct()->select('client_id')->where(['account_typeId' => $savings_account_typeId])->findColumn('client_id');
        if (!$clientIds_entries) {
            return $this->respond([
                'status' => 404,
                'error' => 'Not Found',
                'message' => "No Client Savings Entries Found",
            ]);
        }

        // Remove duplicate IDs
        $entryClient_ids = array_unique($clientIds_entries);

        // Get all savings particulars once
        $savingsParticulars = $this->particular->select('particulars.id, particulars.particular_code, particulars.particular_name, particulars.category_id, categories.part')
            ->join('categories', 'categories.id = particulars.category_id', 'left')
            ->where(['account_typeId' => $savings_account_typeId])
            ->findAll();

SELECT *
FROM `clients`
WHERE `clients`.`deleted_at` IS NULL
AND `clients`.`id` = '1'
---

        // Loop through clients
        foreach ($allClientIds as $clientId) {
            $clientRow = $this->client->find($clientId);

UPDATE `clients` SET `account_balance` = 10000, `savings_products` = '[{\"product_id\":\"1\",\"product_name\":\"Direct Savings\",\"product_balance\":0}]', `updated_at` = '2024-11-01 18:15:56'
WHERE `clients`.`id` IN ('1')
---
                'account_balance' => $totalBalance,
                'savings_products' => !empty($savingsProducts) ? json_encode($savingsProducts) : json_encode([]),
            ];
            $update = $this->client->update($clientId, $updateData);

SELECT DISTINCT `particular_id`, `particular_id`
FROM `entries`
WHERE `entries`.`deleted_at` IS NULL
SELECT DISTINCT `payment_id`, `payment_id`
FROM `entries`
WHERE `entries`.`deleted_at` IS NULL
---
    public function auto_calc_particularTotals()
    {
        # Fetch distinct particular_ids (both particular_id and payment_id)
        $particularIds = $this->entry->distinct()->select('particular_id')->findColumn('particular_id');
        if (!$particularIds) {
            $particularIds = []; // Assign an empty array if null or empty
        }
        $paymentIds = $this->entry->distinct()->select('payment_id')->findColumn('payment_id');

SELECT *
FROM `disbursements`
WHERE `class` != 'Cleared'
AND `disbursements`.`deleted_at` IS NULL
SELECT *
FROM `loanproducts`
WHERE `loanproducts`.`deleted_at` IS NULL
AND `loanproducts`.`id` = '1'
---
    protected function auto_disbursementState()
    {
        $allDisbursements = $this->disbursement->where(['class !=' => 'Cleared'])->findAll();
        if (empty($allDisbursements)) {
            return $this->respond([
                'status' => 404,
                'error' => 'Not Found',
                'message' => 'No Disbursements Found!',
            ]);
        }

        $currentDate = Time::today(); // Get current date
        $updateDays = false;
        $responseUpdates = [];

        foreach ($allDisbursements as $row) {
            $arrears_info = [
                'arrears_count' => 0,
                'total_days' => 0,
            ];

            $installmentAmt = $row['actual_installment'];
            $status = $row['status'];
            $class = $row["class"];
            $client_id = $row["client_id"];
            $principal_due = $row["principal_due"];
            $interest_due = $row["interest_due"];
            $installments_due = $row["installments_due"];

            // Fetch product and application info in one go
            $productRow = $this->loanProduct->find($row['product_id']);

UPDATE `disbursements` SET `principal_installment` = 500000, `interest_installment` = 200000, `days_remaining` = '+120', `days_covered` = 0, `installments_covered` = 0, `expected_amount_recovered` = 0, `expected_loan_balance` = 2800000, `interest_balance` = 800000, `principal_balance` = 2000000, `total_balance` = 2800000, `arrears` = 0, `arrears_info` = '{\"arrears_count\":0,\"total_days\":0}', `principal_due` = '0', `interest_due` = '0', `installments_due` = 0, `days_due` = 0, `status` = 'Open', `class` = 'Running', `comments` = 'Okay', `updated_at` = '2024-11-01 18:15:57'
WHERE `disbursements`.`id` IN ('3')
---
            ];

            // Update disbursement
            $responseUpdates[] = $this->disbursement->update($row['id'], $autoData);

SELECT DISTINCT `disbursement_id`, `disbursement_id`
FROM `entries`
WHERE `account_typeId` = 3
AND `entries`.`deleted_at` IS NULL
SELECT *
FROM `disbursements`
WHERE `id` IN ('1','2','3')
AND `disbursements`.`deleted_at` IS NULL
---
    protected function auto_update_disbursementBalances()
    {
        $loan_account_typeId  = 3; // Gross principal account Type ID
        $interest_account_typeId = 19; // Interest on loans account type

        // Get distinct disbursement IDs
        $disbursementIds = $this->entry->distinct()->select('disbursement_id')
            ->where(['account_typeId' => $loan_account_typeId])
            ->findColumn('disbursement_id');

        if (!$disbursementIds) {
            return $this->respond([
                'status' => 404,
                'error' => 'Not Found',
                'message' => "No Disbursement IDs Found",
            ]);
        }

        // Preload disbursement rows
        $disbursements = $this->disbursement->whereIn('id', $disbursementIds)->findAll();

SELECT *
FROM `particulars`
WHERE `account_typeId` = 19
AND `particulars`.`deleted_at` IS NULL
 LIMIT 1
---
            ]);
        }
        // Preload interest particulars (used repeatedly)
        $interestParticular = $this->particular->where(['account_typeId' => $interest_account_typeId])->first();

UPDATE `disbursements` SET `principal_balance` = 0, `interest_balance` = 0, `total_balance` = 0, `interest_collected` = '100000', `principal_collected` = '250000', `total_collected` = '350000', `updated_at` = '2024-11-01 18:15:57'
WHERE `disbursements`.`id` IN (1)
---

        // Perform batch updates
        foreach ($updates as $disbursement_id => $disbursementData) {
            $this->disbursement->update($disbursement_id, $disbursementData);