app/Models/EntriesModel.php

SELECT DISTINCT `particular_id`, `particular_id`
FROM `entries`
WHERE `entries`.`deleted_at` IS NULL
SELECT DISTINCT `payment_id`, `payment_id`
FROM `entries`
WHERE `entries`.`deleted_at` IS NULL
---
    public function calculateTotalBalance(array $data)
    {
        # pick values from array
        $module = $data['module'];
        $module_id = $data['module_id'];
        $status = $data['status'];
        $entryId = (isset($data['entryId']) ? $data['entryId'] : null);
        $start_date = (isset($data['start_date']) ? $data['start_date'] : null);
        $end_date = (isset($data['end_date']) ? $data['end_date'] : null);

        # Initialize variables to store aggregated totals
        $particularTotals = [];
        $subcategoryTotals = [];
        $categoryTotals = [];
        $accountTypeTotals = [];
        $cashFlowTotals = [];

        # Fetch distinct particular_ids (both particular_id and payment_id)
        $particularIds = $this->distinct()->select('particular_id')->findColumn('particular_id');
        if (!$particularIds) {
            $particularIds = []; // Assign an empty array if null or empty
        }
        $paymentIds = $this->distinct()->select('payment_id')->findColumn('payment_id');

SELECT `id`, `particular_name`, `debit`, `credit`, `particular_status`, `category_id`, `subcategory_id`, `account_typeId`, `cash_flow_typeId`
FROM `particulars`
WHERE `id` = '1'
---

            # Now aggregate the totals by subcategory, category, account_type, cash_flow
            $columns = ['id', 'particular_name', 'debit', 'credit', 'particular_status', 'category_id', 'subcategory_id', 'account_typeId', 'cash_flow_typeId'];
            $particularData = $this->db->table('particulars')->select($columns)->where('id', $particular_id)->get()->getRow();